# FileFormat Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileWriteOptions..::..FileFormat Property
IFCFileWriteOptions Class See Also
---
The file format of the IFC file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCFileFormat FileFormat { get; set; }
```

Visual Basic
---
```text
Public Property FileFormat As IFCFileFormat
	Get
	Set
```

Visual C++
---
```text
public:
property IFCFileFormat FileFormat {
	IFCFileFormat get ();
	void set (IFCFileFormat value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace